nce2-4/L96.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil

* Lesson 96 The dead return
#+begin_verse
What happens to the lanterns at the end of festival?

A Festival for the Dead is held once a year in Japan.
This festival is a cheerful occasion,
	for on this day, the dead are said to *return to their homes*
		and they are welcomed by the living.
As they *are expected to be* hungry after their long journey,
	*food is laid out* for them.
Specially-made lanterns are hung outside each house
	to help the dead to find their way.
All night long, people dance and sing.
In the early morning, the food that had been laid out for the dead
		is thrown into a river or into the sea
	as *it is considered unlucky for anyone living* to eat it.
In towns that are near the sea,
	the tiny lanterns which had been hung in the streets the night before,
		*are placed into* the water
	when the festival is over.
Thousands of lanterns slowly drift out to sea
	guiding the dead on their return journey to the other world.
This is a moving spectacle,
	for crowds of people stand on the shore
		watching the lanterns drifting away
	until they can be seen no more.

#+end_verse

** words
festival [ˈfestɪv(ə)l] n.节日
lantern [ˈlæntə(r)n] n.灯笼
spectacle [ˈspektək(ə)l] n.景象,壮观,场面

** DONE 单词造句
CLOSED: [2023-10-18 Wed 19:52]
festival n.
1. How long did the Spring Festival last for last year? He asked drily.
2. The boy set the cron stalk on fire in the field at the festival.
3. The building was burnt down at the festival.
4. It says on the bulletin board. We're going on vacation at the festival.
5. Don't get into such a mess at the Spring Festival.
lantern n.
1. The workers are accustomed to make lanterns.
2. I have been instructed in making lanterns.
3. Thousands of lanterns were lined up on the floor of the square.
4. He proved that there were a great many of lanterns in the basement.
5. They compete against each other to make more lanterns.
spectacle n. make a spectacle of oneself
1. Don't make a spectacle of yourself at the Spring festival.
2. Although he made a spectacle of himself, he was still very popular with these young children.
3. He who was reluctant to tell stories was making a spectacle of himself.
4. He who is always late makes a spectacle of himself over and over again.
5. The boy who failed to take the corn to pieces made a spectacle of himself.
moving adj.
1. Didn't you find that story very moving?
2. I hate to feel moving while I am watching a comedy.
3. She was called in to tell a moving story.
4. Instead of feeling moving, she got very angry.
5. Soon afterwards, people all over the world know the building take its name from a moving story.
** 反复听电影片段
** Pattern Drill 写+读
** 给自己讲解
** 红皮书
** DONE 习惯用法造句
CLOSED: [2023-10-18 Wed 19:52]
return to sp.
1. I am going to return to my hometown after I retire.
2. The moment I get off work, I'll return to my home and watch TV.
3. I used to return to my home running after the sunset.
4. My mother usually orders me to return to my home as soon as possible.
5. Mr. Leo was relieved to hear that I had returned to my home.
be expected to be
1. My wife is expected to be angry.
2. I am always expected to get a good salary.
3. The students have been expected to be volunteers.
4. The press was expected to tell people the truth.
5. The busmen were not expected to go on a strike.
sth. is laid out
1. Why is the food laid out?
2. She has stated that thousands of mummy are laid out in the exhibition.
3. A lot of vehicles are laid out on display.
4. A variety of eating fishes are laid out for sale in the supermarket.
5. He refused to lay out his precious pen.
it is considered unlucky for sb. doing
1. It is considered unlucky for anyone touching the tree.
2. It is considered unlucky for anyone having his hair cut.
3. It is considered unlucky for him losing his life in a car accident.
4. It is considered unlucky for the actor making a spectacle of himself.
5. It is considered unlucky for him staying out of the limelight.
be placed into
1. The parcel has already been placed into stones and sands.
2. My garage was placed into a variety of furnitures the night before.
3. The football was placed into water.
4. I have trouble placing the lantern into water.
5. The tent has been placed into the corn stalks.
** 跟读至背诵
** Ask me if 写+读
** 摘要写作
** tell the story 口语
** Topics for discussion
