nce2-4/L96.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-18 Wed 19:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-org9cc2d17" class="outline-2">
<h2 id="org9cc2d17">Lesson 96 The dead return</h2>
<div class="outline-text-2" id="text-org9cc2d17">
<p class="verse">
What happens to the lanterns at the end of festival?<br />
<br />
A Festival for the Dead is held once a year in Japan.<br />
This festival is a cheerful occasion,<br />
&#xa0;for on this day, the dead are said to <b>return to their homes</b><br />
&#xa0;&#xa0;and they are welcomed by the living.<br />
As they <b>are expected to be</b> hungry after their long journey,<br />
&#xa0;<b>food is laid out</b> for them.<br />
Specially-made lanterns are hung outside each house<br />
&#xa0;to help the dead to find their way.<br />
All night long, people dance and sing.<br />
In the early morning, the food that had been laid out for the dead<br />
&#xa0;&#xa0;is thrown into a river or into the sea<br />
&#xa0;as <b>it is considered unlucky for anyone living</b> to eat it.<br />
In towns that are near the sea,<br />
&#xa0;the tiny lanterns which had been hung in the streets the night before,<br />
&#xa0;&#xa0;<b>are placed into</b> the water<br />
&#xa0;when the festival is over.<br />
Thousands of lanterns slowly drift out to sea<br />
&#xa0;guiding the dead on their return journey to the other world.<br />
This is a moving spectacle,<br />
&#xa0;for crowds of people stand on the shore<br />
&#xa0;&#xa0;watching the lanterns drifting away<br />
&#xa0;until they can be seen no more.<br />
<br />
</p>
</div>

<div id="outline-container-orge7778e4" class="outline-3">
<h3 id="orge7778e4">words</h3>
<div class="outline-text-3" id="text-orge7778e4">
<p>
festival [ˈfestɪv(ə)l] n.节日<br />
lantern [ˈlæntə(r)n] n.灯笼<br />
spectacle [ˈspektək(ə)l] n.景象,壮观,场面<br />
</p>
</div>
</div>

<div id="outline-container-org70f0348" class="outline-3">
<h3 id="org70f0348"><span class="done DONE">DONE</span> 单词造句</h3>
<div class="outline-text-3" id="text-org70f0348">
<p>
festival n.<br />
</p>
<ol class="org-ol">
<li>How long did the Spring Festival last for last year? He asked drily.<br /></li>
<li>The boy set the cron stalk on fire in the field at the festival.<br /></li>
<li>The building was burnt down at the festival.<br /></li>
<li>It says on the bulletin board. We're going on vacation at the festival.<br /></li>
<li>Don't get into such a mess at the Spring Festival.<br /></li>
</ol>
<p>
lantern n.<br />
</p>
<ol class="org-ol">
<li>The workers are accustomed to make lanterns.<br /></li>
<li>I have been instructed in making lanterns.<br /></li>
<li>Thousands of lanterns were lined up on the floor of the square.<br /></li>
<li>He proved that there were a great many of lanterns in the basement.<br /></li>
<li>They compete against each other to make more lanterns.<br /></li>
</ol>
<p>
spectacle n. make a spectacle of oneself<br />
</p>
<ol class="org-ol">
<li>Don't make a spectacle of yourself at the Spring festival.<br /></li>
<li>Although he made a spectacle of himself, he was still very popular with these young children.<br /></li>
<li>He who was reluctant to tell stories was making a spectacle of himself.<br /></li>
<li>He who is always late makes a spectacle of himself over and over again.<br /></li>
<li>The boy who failed to take the corn to pieces made a spectacle of himself.<br /></li>
</ol>
<p>
moving adj.<br />
</p>
<ol class="org-ol">
<li>Didn't you find that story very moving?<br /></li>
<li>I hate to feel moving while I am watching a comedy.<br /></li>
<li>She was called in to tell a moving story.<br /></li>
<li>Instead of feeling moving, she got very angry.<br /></li>
<li>Soon afterwards, people all over the world know the building take its name from a moving story.<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org570f613" class="outline-3">
<h3 id="org570f613">反复听电影片段</h3>
</div>
<div id="outline-container-orgcb3e31c" class="outline-3">
<h3 id="orgcb3e31c">Pattern Drill 写+读</h3>
</div>
<div id="outline-container-orgce190f0" class="outline-3">
<h3 id="orgce190f0">给自己讲解</h3>
</div>
<div id="outline-container-org7e23b3e" class="outline-3">
<h3 id="org7e23b3e">红皮书</h3>
</div>
<div id="outline-container-org2792342" class="outline-3">
<h3 id="org2792342"><span class="done DONE">DONE</span> 习惯用法造句</h3>
<div class="outline-text-3" id="text-org2792342">
<p>
return to sp.<br />
</p>
<ol class="org-ol">
<li>I am going to return to my hometown after I retire.<br /></li>
<li>The moment I get off work, I'll return to my home and watch TV.<br /></li>
<li>I used to return to my home running after the sunset.<br /></li>
<li>My mother usually orders me to return to my home as soon as possible.<br /></li>
<li>Mr. Leo was relieved to hear that I had returned to my home.<br /></li>
</ol>
<p>
be expected to be<br />
</p>
<ol class="org-ol">
<li>My wife is expected to be angry.<br /></li>
<li>I am always expected to get a good salary.<br /></li>
<li>The students have been expected to be volunteers.<br /></li>
<li>The press was expected to tell people the truth.<br /></li>
<li>The busmen were not expected to go on a strike.<br /></li>
</ol>
<p>
sth. is laid out<br />
</p>
<ol class="org-ol">
<li>Why is the food laid out?<br /></li>
<li>She has stated that thousands of mummy are laid out in the exhibition.<br /></li>
<li>A lot of vehicles are laid out on display.<br /></li>
<li>A variety of eating fishes are laid out for sale in the supermarket.<br /></li>
<li>He refused to lay out his precious pen.<br /></li>
</ol>
<p>
it is considered unlucky for sb. doing<br />
</p>
<ol class="org-ol">
<li>It is considered unlucky for anyone touching the tree.<br /></li>
<li>It is considered unlucky for anyone having his hair cut.<br /></li>
<li>It is considered unlucky for him losing his life in a car accident.<br /></li>
<li>It is considered unlucky for the actor making a spectacle of himself.<br /></li>
<li>It is considered unlucky for him staying out of the limelight.<br /></li>
</ol>
<p>
be placed into<br />
</p>
<ol class="org-ol">
<li>The parcel has already been placed into stones and sands.<br /></li>
<li>My garage was placed into a variety of furnitures the night before.<br /></li>
<li>The football was placed into water.<br /></li>
<li>I have trouble placing the lantern into water.<br /></li>
<li>The tent has been placed into the corn stalks.<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgddaf869" class="outline-3">
<h3 id="orgddaf869">跟读至背诵</h3>
</div>
<div id="outline-container-orge94503c" class="outline-3">
<h3 id="orge94503c">Ask me if 写+读</h3>
</div>
<div id="outline-container-orgd8f793e" class="outline-3">
<h3 id="orgd8f793e">摘要写作</h3>
</div>
<div id="outline-container-org597e06c" class="outline-3">
<h3 id="org597e06c">tell the story 口语</h3>
</div>
<div id="outline-container-org3eb9aa2" class="outline-3">
<h3 id="org3eb9aa2">Topics for discussion</h3>
</div>
</div>
</div>
</body>
</html>
